import pandas as pd

def get_data():
    dishes = [
        # name,                category,       diet,           calories, proteins, fats, carbs,   tags
        ("Курица с овощами",   "горячее",      "обычное",      450,      35,       14,   40,      "курица,без свинины,без остро"),
        ("Рыба на пару",       "горячее",      "диетическое",  220,      28,       6,    2,       "рыба,легкое,без глютена"),
        ("Гречка с мясом",     "горячее",      "сытное",       520,      25,       12,   70,      "говядина,сытно"),
        ("Омлет с овощами",    "завтрак",      "вегетарианское",300,      18,       18,   8,       "омлет,овощи"),
        ("Салат Цезарь",       "салат",        "обычное",      380,      24,       22,   20,      "курица,салат"),
        ("Паста с томатами",   "горячее",      "вегетарианское",430,      14,       12,   62,      "паста,без свинины"),
    ]
    df = pd.DataFrame(dishes, columns=[
        "name","category","diet","calories","proteins","fats","carbs","tags"
    ])
    return df
